<?php

use Illuminate\Support\Facades\Schema;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Database\Migrations\Migration;

class CreateCitiesSliderTable extends Migration
{
    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        if(!Schema::hasTable('partners')) {
            Schema::create('partners', function (Blueprint $table) {
                $table->increments('id');
                $table->string('link');
                $table->string('image');
                $table->timestamps();
            });
        }

        DB::statement("INSERT INTO `cities` (`id`, `name_ru`, `description`, `image`, `created_at`, `updated_at`) VALUES
(1, 'Астана', NULL, '1542096849.jpg', '2018-11-12 18:37:39', '2018-11-12 20:14:09'),
(2, 'Актау', NULL, '1542096865.jpg', '2018-11-12 20:14:25', '2018-11-12 20:14:25'),
(3, 'Актобе', NULL, '1542096879.jpg', '2018-11-12 20:14:39', '2018-11-12 20:14:39'),
(4, 'Алматы', NULL, '1542096889.jpg', '2018-11-12 20:14:49', '2018-11-12 20:14:49'),
(5, 'Аркалык', NULL, '1542096900.jpg', '2018-11-12 20:15:00', '2018-11-12 20:15:00'),
(6, 'Атырау', NULL, '1542096912.jpg', '2018-11-12 20:15:12', '2018-11-12 20:15:12'),
(7, 'Жезказган', NULL, '1542096925.jpg', '2018-11-12 20:15:25', '2018-11-12 20:15:25'),
(8, 'Жетысай', NULL, '1542096937.jpg', '2018-11-12 20:15:37', '2018-11-12 20:15:37'),
(9, 'Караганды', NULL, '1542096948.jpg', '2018-11-12 20:15:48', '2018-11-12 20:15:48'),
(10, 'Каскелен', NULL, '1542096962.jpg', '2018-11-12 20:16:02', '2018-11-12 20:16:02'),
(11, 'Кокшетау', NULL, '1542096975.jpg', '2018-11-12 20:16:15', '2018-11-12 20:16:15'),
(12, 'Костанай', NULL, '1542096986.jpg', '2018-11-12 20:16:26', '2018-11-12 20:16:26'),
(13, 'Кызылорда', NULL, '1542096999.jpg', '2018-11-12 20:16:39', '2018-11-12 20:16:39'),
(14, 'Орал', NULL, '1542097011.jpeg', '2018-11-12 20:16:51', '2018-11-12 20:16:51'),
(15, 'Оскемен', NULL, '1542097023.jpg', '2018-11-12 20:17:03', '2018-11-12 20:17:03'),
(16, 'Павлодар', NULL, '1542097040.jpg', '2018-11-12 20:17:20', '2018-11-12 20:17:20'),
(17, 'Петропавловск', NULL, '1542097060.jpg', '2018-11-12 20:17:40', '2018-11-12 20:17:40'),
(18, 'Рудный', NULL, '1542097075.jpg', '2018-11-12 20:17:55', '2018-11-12 20:17:55'),
(19, 'Семей', NULL, '1542097087.jpg', '2018-11-12 20:18:07', '2018-11-12 20:18:07'),
(20, 'Талдыкорган', NULL, '1542097104.jpg', '2018-11-12 20:18:24', '2018-11-12 20:18:24'),
(21, 'Тараз', NULL, '1542097119.jpg', '2018-11-12 20:18:39', '2018-11-12 20:18:39'),
(22, 'Темиртау', NULL, '1542097133.jpg', '2018-11-12 20:18:53', '2018-11-12 20:18:53'),
(23, 'Туркестан', 'Описание', '1542097149.jpg', '2018-11-12 20:19:09', '2018-11-12 20:19:09'),
(24, 'Шымкент', NULL, '1542097163.jpg', '2018-11-12 20:19:23', '2018-11-12 20:19:23'),
(25, 'Экибастуз', NULL, '1542731705.jpg', '2018-11-12 20:19:38', '2018-12-03 05:32:38');");
    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        Schema::dropIfExists('cities_slider');
    }
}
